## [Portal GitOps Resources](https://ziggy.app.us.spacelift.io/stack/portal-gitops-resources/run/01KMH7KNTE0J33H47A72A0BKCC) plan logs

<details>
<summary>Click here to expand</summary>

```
...
                                      + localhostProfile = (known after apply)
                                      + type             = (known after apply)
                                    }
                                  + fsGroup                  = 2000
                                  + fsGroupChangePolicy      = (known after apply)
                                  + runAsGroup               = 2000
                                  + runAsNonRoot             = true
                                  + runAsUser                = 2000
                                  + seLinuxChangePolicy      = (known after apply)
                                  + seLinuxOptions           = {
                                      + level = (known after apply)
                                      + role  = (known after apply)
                                      + type  = (known after apply)
                                      + user  = (known after apply)
                                    }
                                  + seccompProfile           = {
                                      + localhostProfile = (known after apply)
                                      + type             = "RuntimeDefault"
                                    }
                                  + supplementalGroups       = (known after apply)
                                  + supplementalGroupsPolicy = (known after apply)
                                  + sysctls                  = (known after apply)
                                  + windowsOptions           = {
                                      + gmsaCredentialSpec     = (known after apply)
                                      + gmsaCredentialSpecName = (known after apply)
                                      + hostProcess            = (known after apply)
                                      + runAsUserName          = (known after apply)
                                    }
                                }
                              + serviceAccount                = (known after apply)
                              + serviceAccountName            = (known after apply)
                              + setHostnameAsFQDN             = (known after apply)
                              + shareProcessNamespace         = (known after apply)
                              + subdomain                     = (known after apply)
                              + terminationGracePeriodSeconds = (known after apply)
                              + tolerations                   = (known after apply)
                              + topologySpreadConstraints     = (known after apply)
                              + volumes                       = (known after apply)
                            }
                        }
                    }
                }
              + serviceAccountTemplate = {
                  + metadata = {
                      + annotations = (known after apply)
                      + labels      = (known after apply)
                      + name        = (known after apply)
                    }
                }
              + serviceTemplate        = {
                  + metadata = {
                      + annotations = (known after apply)
                      + labels      = (known after apply)
                      + name        = (known after apply)
                    }
                }
            }
        }
    }

  # kubernetes_manifest.function_environment_configs will be created
  + resource "kubernetes_manifest" "function_environment_configs" {
      + manifest = {
          + apiVersion = "pkg.crossplane.io/v1beta1"
          + kind       = "Function"
          + metadata   = {
              + name = "function-environment-configs"
            }
          + spec       = {
              + package          = "xpkg.upbound.io/crossplane-contrib/function-environment-configs:v0.6.0"
              + runtimeConfigRef = {
                  + name = "function-environment-configs-runtime-config"
                }
            }
        }
      + object   = {
          + apiVersion = "pkg.crossplane.io/v1beta1"
          + kind       = "Function"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "function-environment-configs"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + commonLabels                = (known after apply)
              + ignoreCrossplaneConstraints = (known after apply)
              + package                     = "xpkg.upbound.io/crossplane-contrib/function-environment-configs:v0.6.0"
              + packagePullPolicy           = (known after apply)
              + packagePullSecrets          = (known after apply)
              + revisionActivationPolicy    = (known after apply)
              + revisionHistoryLimit        = (known after apply)
              + runtimeConfigRef            = {
                  + apiVersion = (known after apply)
                  + kind       = (known after apply)
                  + name       = "function-environment-configs-runtime-config"
                }
              + skipDependencyResolution    = (known after apply)
            }
        }
    }

  # kubernetes_manifest.function_environment_configs_runtime_config will be created
  + resource "kubernetes_manifest" "function_environment_configs_runtime_config" {
      + manifest = {
          + apiVersion = "pkg.crossplane.io/v1beta1"
          + kind       = "DeploymentRuntimeConfig"
          + metadata   = {
              + name = "function-environment-configs-runtime-config"
            }
          + spec       = {
              + deploymentTemplate = {
                  + spec = {
                      + selector = {
                          + matchLabels = {
                              + "pkg.crossplane.io/function" = "function-environment-configs"
                            }
                        }
                      + template = {
                          + spec = {
                              + containers      = [
                                  + {
                                      + name            = "package-runtime"
                                      + resources       = {
                                          + limits   = {
                                              + memory = "256Mi"
                                            }
                                          + requests = {
                                              + cpu    = "15m"
                                              + memory = "128Mi"
                                            }
                                        }
                                      + securityContext = {
                                          + allowPrivilegeEscalation = false
                                          + capabilities             = {
                                              + drop = [
                                                  + "ALL",
                                                ]
                                            }
                                          + privileged               = false
                                          + readOnlyRootFilesystem   = true
                                        }
                                    },
                                ]
                              + securityContext = {
                                  + fsGroup        = 2000
                                  + runAsGroup     = 2000
                                  + runAsNonRoot   = true
                                  + runAsUser      = 2000
                                  + seccompProfile = {
                                      + type = "RuntimeDefault"
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }
      + object   = {
          + apiVersion = "pkg.crossplane.io/v1beta1"
          + kind       = "DeploymentRuntimeConfig"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "function-environment-configs-runtime-config"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + deploymentTemplate     = {
                  + metadata = {
                      + annotations = (known after apply)
                      + labels      = (known after apply)
                      + name        = (known after apply)
                    }
                  + spec     = {
                      + minReadySeconds         = (known after apply)
                      + paused                  = (known after apply)
                      + progressDeadlineSeconds = (known after apply)
                      + replicas                = (known after apply)
                      + revisionHistoryLimit    = (known after apply)
                      + selector                = {
                          + matchExpressions = (known after apply)
                          + matchLabels      = {
                              + "pkg.crossplane.io/function" = "function-environment-configs"
                            }
                        }
                      + strategy                = {
                          + rollingUpdate = {
                              + maxSurge       = (known after apply)
                              + maxUnavailable = (known after apply)
                            }
                          + type          = (known after apply)
                        }
                      + template                = {
                          + metadata = {
                              + annotations = (known after apply)
                              + finalizers  = (known after apply)
                              + labels      = (known after apply)
                              + name        = (known after apply)
                              + namespace   = (known after apply)
                            }
                          + spec     = {
                              + activeDeadlineSeconds         = (known after apply)
                              + affinity                      = {
                                  + nodeAffinity    = {
                                      + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                      + requiredDuringSchedulingIgnoredDuringExecution  = {
                                          + nodeSelectorTerms = (known after apply)
                                        }
                                    }
                                  + podAffinity     = {
                                      + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                      + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                    }
                                  + podAntiAffinity = {
                                      + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                      + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                    }
                                }
                              + automountServiceAccountToken  = (known after apply)
                              + containers                    = [
                                  + {
                                      + args                     = (known after apply)
                                      + command                  = (known after apply)
                                      + env                      = (known after apply)
                                      + envFrom                  = (known after apply)
                                      + image                    = (known after apply)
                                      + imagePullPolicy          = (known after apply)
                                      + lifecycle                = {
                                          + postStart  = {
                                              + exec      = {
                                                  + command = (known after apply)
                                                }
                                              + httpGet   = {
                                                  + host        = (known after apply)
                                                  + httpHeaders = (known after apply)
                                                  + path        = (known after apply)
                                                  + port        = (known after apply)
                                                  + scheme      = (known after apply)
                                                }
                                              + sleep     = {
                                                  + seconds = (known after apply)
                                                }
                                              + tcpSocket = {
                                                  + host = (known after apply)
                                                  + port = (known after apply)
                                                }
                                            }
                                          + preStop    = {
                                              + exec      = {
                                                  + command = (known after apply)
                                                }
                                              + httpGet   = {
                                                  + host        = (known after apply)
                                                  + httpHeaders = (known after apply)
                                                  + path        = (known after apply)
                                                  + port        = (known after apply)
                                                  + scheme      = (known after apply)
                                                }
                                              + sleep     = {
                                                  + seconds = (known after apply)
                                                }
                                              + tcpSocket = {
                                                  + host = (known after apply)
                                                  + port = (known after apply)
                                                }
                                            }
                                          + stopSignal = (known after apply)
                                        }
                                      + livenessProbe            = {
                                          + exec                          = {
                                              + command = (known after apply)
                                            }
                                          + failureThreshold              = (known after apply)
                                          + grpc                          = {
                                              + port    = (known after apply)
                                              + service = (known after apply)
                                            }
                                          + httpGet                       = {
                                              + host        = (known after apply)
                                              + httpHeaders = (known after apply)
                                              + path        = (known after apply)
                                              + port        = (known after apply)
                                              + scheme      = (known after apply)
                                            }
                                          + initialDelaySeconds           = (known after apply)
                                          + periodSeconds                 = (known after apply)
                                          + successThreshold              = (known after apply)
                                          + tcpSocket                     = {
                                              + host = (known after apply)
                                              + port = (known after apply)
                                            }
                                          + terminationGracePeriodSeconds = (known after apply)
                                          + timeoutSeconds                = (known after apply)
                                        }
                                      + name                     = "package-runtime"
                                      + ports                    = (known after apply)
                                      + readinessProbe           = {
                                          + exec                          = {
                                              + command = (known after apply)
                                            }
                                          + failureThreshold              = (known after apply)
                                          + grpc                          = {
                                              + port    = (known after apply)
                                              + service = (known after apply)
                                            }
                                          + httpGet                       = {
                                              + host        = (known after apply)
                                              + httpHeaders = (known after apply)
                                              + path        = (known after apply)
                                              + port        = (known after apply)
                                              + scheme      = (known after apply)
                                            }
                                          + initialDelaySeconds           = (known after apply)
                                          + periodSeconds                 = (known after apply)
                                          + successThreshold              = (known after apply)
                                          + tcpSocket                     = {
                                              + host = (known after apply)
                                              + port = (known after apply)
                                            }
                                          + terminationGracePeriodSeconds = (known after apply)
                                          + timeoutSeconds                = (known after apply)
                                        }
                                      + resizePolicy             = (known after apply)
                                      + resources                = {
                                          + claims   = (known after apply)
                                          + limits   = {
                                              + memory = "256Mi"
                                            }
                                          + requests = {
                                              + cpu    = "15m"
                                              + memory = "128Mi"
                                            }
                                        }
                                      + restartPolicy            = (known after apply)
                                      + restartPolicyRules       = (known after apply)
                                      + securityContext          = {
                                          + allowPrivilegeEscalation = false
                                          + appArmorProfile          = {
                                              + localhostProfile = (known after apply)
                                              + type             = (known after apply)
                                            }
                                          + capabilities             = {
                                              + add  = (known after apply)
                                              + drop = [
                                                  + "ALL",
                                                ]
                                            }
                                          + privileged               = false
                                          + procMount                = (known after apply)
                                          + readOnlyRootFilesystem   = true
                                          + runAsGroup               = (known after apply)
                                          + runAsNonRoot             = (known after apply)
                                          + runAsUser                = (known after apply)
                                          + seLinuxOptions           = {
                                              + level = (known after apply)
                                              + role  = (known after apply)
                                              + type  = (known after apply)
                                              + user  = (known after apply)
                                            }
                                          + seccompProfile           = {
                                              + localhostProfile = (known after apply)
                                              + type             = (known after apply)
                                            }
                                          + windowsOptions           = {
                                              + gmsaCredentialSpec     = (known after apply)
                                              + gmsaCredentialSpecName = (known after apply)
                                              + hostProcess            = (known after apply)
                                              + runAsUserName          = (known after apply)
                                            }
                                        }
                                      + startupProbe             = {
                                          + exec                          = {
                                              + command = (known after apply)
                                            }
                                          + failureThreshold              = (known after apply)
                                          + grpc                          = {
                                              + port    = (known after apply)
                                              + service = (known after apply)
                                            }
                                          + httpGet                       = {
                                              + host        = (known after apply)
                                              + httpHeaders = (known after apply)
                                              + path        = (known after apply)
                                              + port        = (known after apply)
                                              + scheme      = (known after apply)
                                            }
                                          + initialDelaySeconds           = (known after apply)
                                          + periodSeconds                 = (known after apply)
                                          + successThreshold              = (known after apply)
                                          + tcpSocket                     = {
                                              + host = (known after apply)
                                              + port = (known after apply)
                                            }
                                          + terminationGracePeriodSeconds = (known after apply)
                                          + timeoutSeconds                = (known after apply)
                                        }
                                      + stdin                    = (known after apply)
                                      + stdinOnce                = (known after apply)
                                      + terminationMessagePath   = (known after apply)
                                      + terminationMessagePolicy = (known after apply)
                                      + tty                      = (known after apply)
                                      + volumeDevices            = (known after apply)
                                      + volumeMounts             = (known after apply)
                                      + workingDir               = (known after apply)
                                    },
                                ]
                              + dnsConfig                     = {
                                  + nameservers = (known after apply)
                                  + options     = (known after apply)
                                  + searches    = (known after apply)
                                }
                              + dnsPolicy                     = (known after apply)
                              + enableServiceLinks            = (known after apply)
                              + ephemeralContainers           = (known after apply)
                              + hostAliases                   = (known after apply)
                              + hostIPC                       = (known after apply)
                              + hostNetwork                   = (known after apply)
                              + hostPID                       = (known after apply)
                              + hostUsers                     = (known after apply)
                              + hostname                      = (known after apply)
                              + hostnameOverride              = (known after apply)
                              + imagePullSecrets              = (known after apply)
                              + initContainers                = (known after apply)
                              + nodeName                      = (known after apply)
                              + nodeSelector                  = (known after apply)
                              + os                            = {
                                  + name = (known after apply)
                                }
                              + overhead                      = (known after apply)
                              + preemptionPolicy              = (known after apply)
                              + priority                      = (known after apply)
                              + priorityClassName             = (known after apply)
                              + readinessGates                = (known after apply)
                              + resourceClaims                = (known after apply)
                              + resources                     = {
                                  + claims   = (known after apply)
                                  + limits   = (known after apply)
                                  + requests = (known after apply)
                                }
                              + restartPolicy                 = (known after apply)
                              + runtimeClassName              = (known after apply)
                              + schedulerName                 = (known after apply)
                              + schedulingGates               = (known after apply)
                              + securityContext               = {
                                  + appArmorProfile          = {
                                      + localhostProfile = (known after apply)
                                      + type             = (known after apply)
                                    }
                                  + fsGroup                  = 2000
                                  + fsGroupChangePolicy      = (known after apply)
                                  + runAsGroup               = 2000
                                  + runAsNonRoot             = true
                                  + runAsUser                = 2000
                                  + seLinuxChangePolicy      = (known after apply)
                                  + seLinuxOptions           = {
                                      + level = (known after apply)
                                      + role  = (known after apply)
                                      + type  = (known after apply)
                                      + user  = (known after apply)
                                    }
                                  + seccompProfile           = {
                                      + localhostProfile = (known after apply)
                                      + type             = "RuntimeDefault"
                                    }
                                  + supplementalGroups       = (known after apply)
                                  + supplementalGroupsPolicy = (known after apply)
                                  + sysctls                  = (known after apply)
                                  + windowsOptions           = {
                                      + gmsaCredentialSpec     = (known after apply)
                                      + gmsaCredentialSpecName = (known after apply)
                                      + hostProcess            = (known after apply)
                                      + runAsUserName          = (known after apply)
                                    }
                                }
                              + serviceAccount                = (known after apply)
                              + serviceAccountName            = (known after apply)
                              + setHostnameAsFQDN             = (known after apply)
                              + shareProcessNamespace         = (known after apply)
                              + subdomain                     = (known after apply)
                              + terminationGracePeriodSeconds = (known after apply)
                              + tolerations                   = (known after apply)
                              + topologySpreadConstraints     = (known after apply)
                              + volumes                       = (known after apply)
                            }
                        }
                    }
                }
              + serviceAccountTemplate = {
                  + metadata = {
                      + annotations = (known after apply)
                      + labels      = (known after apply)
                      + name        = (known after apply)
                    }
                }
              + serviceTemplate        = {
                  + metadata = {
                      + annotations = (known after apply)
                      + labels      = (known after apply)
                      + name        = (known after apply)
                    }
                }
            }
        }
    }

  # kubernetes_manifest.function_go_templating will be created
  + resource "kubernetes_manifest" "function_go_templating" {
      + manifest = {
          + apiVersion = "pkg.crossplane.io/v1beta1"
          + kind       = "Function"
          + metadata   = {
              + name = "function-go-templating"
            }
          + spec       = {
              + package          = "xpkg.upbound.io/crossplane-contrib/function-go-templating:v0.11.3"
              + runtimeConfigRef = {
                  + name = "function-go-templating-runtime-config"
                }
            }
        }
      + object   = {
          + apiVersion = "pkg.crossplane.io/v1beta1"
          + kind       = "Function"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "function-go-templating"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + commonLabels                = (known after apply)
              + ignoreCrossplaneConstraints = (known after apply)
              + package                     = "xpkg.upbound.io/crossplane-contrib/function-go-templating:v0.11.3"
              + packagePullPolicy           = (known after apply)
              + packagePullSecrets          = (known after apply)
              + revisionActivationPolicy    = (known after apply)
              + revisionHistoryLimit        = (known after apply)
              + runtimeConfigRef            = {
                  + apiVersion = (known after apply)
                  + kind       = (known after apply)
                  + name       = "function-go-templating-runtime-config"
                }
              + skipDependencyResolution    = (known after apply)
            }
        }
    }

  # kubernetes_manifest.function_go_templating_runtime_config will be created
  + resource "kubernetes_manifest" "function_go_templating_runtime_config" {
      + manifest = {
          + apiVersion = "pkg.crossplane.io/v1beta1"
          + kind       = "DeploymentRuntimeConfig"
          + metadata   = {
              + name = "function-go-templating-runtime-config"
            }
          + spec       = {
              + deploymentTemplate = {
                  + spec = {
                      + selector = {
                          + matchLabels = {
                              + "pkg.crossplane.io/function" = "function-go-templating"
                            }
                        }
                      + template = {
                          + spec = {
                              + containers      = [
                                  + {
                                      + name            = "package-runtime"
                                      + resources       = {
                                          + limits   = {
                                              + memory = "512Mi"
                                            }
                                          + requests = {
                                              + cpu    = "15m"
                                              + memory = "128Mi"
                                            }
                                        }
                                      + securityContext = {
                                          + allowPrivilegeEscalation = false
                                          + capabilities             = {
                                              + drop = [
                                                  + "ALL",
                                                ]
                                            }
                                          + privileged               = false
                                          + readOnlyRootFilesystem   = true
                                        }
                                    },
                                ]
                              + securityContext = {
                                  + fsGroup        = 2000
                                  + runAsGroup     = 2000
                                  + runAsNonRoot   = true
                                  + runAsUser      = 2000
                                  + seccompProfile = {
                                      + type = "RuntimeDefault"
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }
      + object   = {
          + apiVersion = "pkg.crossplane.io/v1beta1"
          + kind       = "DeploymentRuntimeConfig"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "function-go-templating-runtime-config"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + deploymentTemplate     = {
                  + metadata = {
                      + annotations = (known after apply)
                      + labels      = (known after apply)
                      + name        = (known after apply)
                    }
                  + spec     = {
                      + minReadySeconds         = (known after apply)
                      + paused                  = (known after apply)
                      + progressDeadlineSeconds = (known after apply)
                      + replicas                = (known after apply)
                      + revisionHistoryLimit    = (known after apply)
                      + selector                = {
                          + matchExpressions = (known after apply)
                          + matchLabels      = {
                              + "pkg.crossplane.io/function" = "function-go-templating"
                            }
                        }
                      + strategy                = {
                          + rollingUpdate = {
                              + maxSurge       = (known after apply)
                              + maxUnavailable = (known after apply)
                            }
                          + type          = (known after apply)
                        }
                      + template                = {
                          + metadata = {
                              + annotations = (known after apply)
                              + finalizers  = (known after apply)
                              + labels      = (known after apply)
                              + name        = (known after apply)
                              + namespace   = (known after apply)
                            }
                          + spec     = {
                              + activeDeadlineSeconds         = (known after apply)
                              + affinity                      = {
                                  + nodeAffinity    = {
                                      + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                      + requiredDuringSchedulingIgnoredDuringExecution  = {
                                          + nodeSelectorTerms = (known after apply)
                                        }
                                    }
                                  + podAffinity     = {
                                      + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                      + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                    }
                                  + podAntiAffinity = {
                                      + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                      + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                    }
                                }
                              + automountServiceAccountToken  = (known after apply)
                              + containers                    = [
                                  + {
                                      + args                     = (known after apply)
                                      + command                  = (known after apply)
                                      + env                      = (known after apply)
                                      + envFrom                  = (known after apply)
                                      + image                    = (known after apply)
                                      + imagePullPolicy          = (known after apply)
                                      + lifecycle                = {
                                          + postStart  = {
                                              + exec      = {
                                                  + command = (known after apply)
                                                }
                                              + httpGet   = {
                                                  + host        = (known after apply)
                                                  + httpHeaders = (known after apply)
                                                  + path        = (known after apply)
                                                  + port        = (known after apply)
                                                  + scheme      = (known after apply)
                                                }
                                              + sleep     = {
                                                  + seconds = (known after apply)
                                                }
                                              + tcpSocket = {
                                                  + host = (known after apply)
                                                  + port = (known after apply)
                                                }
                                            }
                                          + preStop    = {
                                              + exec      = {
                                                  + command = (known after apply)
                                                }
                                              + httpGet   = {
                                                  + host        = (known after apply)
                                                  + httpHeaders = (known after apply)
                                                  + path        = (known after apply)
                                                  + port        = (known after apply)
                                                  + scheme      = (known after apply)
                                                }
                                              + sleep     = {
                                                  + seconds = (known after apply)
                                                }
                                              + tcpSocket = {
                                                  + host = (known after apply)
                                                  + port = (known after apply)
                                                }
                                            }
                                          + stopSignal = (known after apply)
                                        }
                                      + livenessProbe            = {
                                          + exec                          = {
                                              + command = (known after apply)
                                            }
                                          + failureThreshold              = (known after apply)
                                          + grpc                          = {
                                              + port    = (known after apply)
                                              + service = (known after apply)
                                            }
                                          + httpGet                       = {
                                              + host        = (known after apply)
                                              + httpHeaders = (known after apply)
                                              + path        = (known after apply)
                                              + port        = (known after apply)
                                              + scheme      = (known after apply)
                                            }
                                          + initialDelaySeconds           = (known after apply)
                                          + periodSeconds                 = (known after apply)
                                          + successThreshold              = (known after apply)
                                          + tcpSocket                     = {
                                              + host = (known after apply)
                                              + port = (known after apply)
                                            }
                                          + terminationGracePeriodSeconds = (known after apply)
                                          + timeoutSeconds                = (known after apply)
                                        }
                                      + name                     = "package-runtime"
                                      + ports                    = (known after apply)
                                      + readinessProbe           = {
                                          + exec                          = {
                                              + command = (known after apply)
                                            }
                                          + failureThreshold              = (known after apply)
                                          + grpc                          = {
                                              + port    = (known after apply)
                                              + service = (known after apply)
                                            }
                                          + httpGet                       = {
                                              + host        = (known after apply)
                                              + httpHeaders = (known after apply)
                                              + path        = (known after apply)
                                              + port        = (known after apply)
                                              + scheme      = (known after apply)
                                            }
                                          + initialDelaySeconds           = (known after apply)
                                          + periodSeconds                 = (known after apply)
                                          + successThreshold              = (known after apply)
                                          + tcpSocket                     = {
                                              + host = (known after apply)
                                              + port = (known after apply)
                                            }
                                          + terminationGracePeriodSeconds = (known after apply)
                                          + timeoutSeconds                = (known after apply)
                                        }
                                      + resizePolicy             = (known after apply)
                                      + resources                = {
                                          + claims   = (known after apply)
                                          + limits   = {
                                              + memory = "512Mi"
                                            }
                                          + requests = {
                                              + cpu    = "15m"
                                              + memory = "128Mi"
                                            }
                                        }
                                      + restartPolicy            = (known after apply)
                                      + restartPolicyRules       = (known after apply)
                                      + securityContext          = {
                                          + allowPrivilegeEscalation = false
                                          + appArmorProfile          = {
                                              + localhostProfile = (known after apply)
                                              + type             = (known after apply)
                                            }
                                          + capabilities             = {
                                              + add  = (known after apply)
                                              + drop = [
                                                  + "ALL",
                                                ]
                                            }
                                          + privileged               = false
                                          + procMount                = (known after apply)
                                          + readOnlyRootFilesystem   = true
                                          + runAsGroup               = (known after apply)
                                          + runAsNonRoot             = (known after apply)
                                          + runAsUser                = (known after apply)
                                          + seLinuxOptions           = {
                                              + level = (known after apply)
                                              + role  = (known after apply)
                                              + type  = (known after apply)
                                              + user  = (known after apply)
                                            }
                                          + seccompProfile           = {
                                              + localhostProfile = (known after apply)
                                              + type             = (known after apply)
                                            }
                                          + windowsOptions           = {
                                              + gmsaCredentialSpec     = (known after apply)
                                              + gmsaCredentialSpecName = (known after apply)
                                              + hostProcess            = (known after apply)
                                              + runAsUserName          = (known after apply)
                                            }
                                        }
                                      + startupProbe             = {
                                          + exec                          = {
                                              + command = (known after apply)
                                            }
                                          + failureThreshold              = (known after apply)
                                          + grpc                          = {
                                              + port    = (known after apply)
                                              + service = (known after apply)
                                            }
                                          + httpGet                       = {
                                              + host        = (known after apply)
                                              + httpHeaders = (known after apply)
                                              + path        = (known after apply)
                                              + port        = (known after apply)
                                              + scheme      = (known after apply)
                                            }
                                          + initialDelaySeconds           = (known after apply)
                                          + periodSeconds                 = (known after apply)
                                          + successThreshold              = (known after apply)
                                          + tcpSocket                     = {
                                              + host = (known after apply)
                                              + port = (known after apply)
                                            }
                                          + terminationGracePeriodSeconds = (known after apply)
                                          + timeoutSeconds                = (known after apply)
                                        }
                                      + stdin                    = (known after apply)
                                      + stdinOnce                = (known after apply)
                                      + terminationMessagePath   = (known after apply)
                                      + terminationMessagePolicy = (known after apply)
                                      + tty                      = (known after apply)
                                      + volumeDevices            = (known after apply)
                                      + volumeMounts             = (known after apply)
                                      + workingDir               = (known after apply)
                                    },
                                ]
                              + dnsConfig                     = {
                                  + nameservers = (known after apply)
                                  + options     = (known after apply)
                                  + searches    = (known after apply)
                                }
                              + dnsPolicy                     = (known after apply)
                              + enableServiceLinks            = (known after apply)
                              + ephemeralContainers           = (known after apply)
                              + hostAliases                   = (known after apply)
                              + hostIPC                       = (known after apply)
                              + hostNetwork                   = (known after apply)
                              + hostPID                       = (known after apply)
                              + hostUsers                     = (known after apply)
                              + hostname                      = (known after apply)
                              + hostnameOverride              = (known after apply)
                              + imagePullSecrets              = (known after apply)
                              + initContainers                = (known after apply)
                              + nodeName                      = (known after apply)
                              + nodeSelector                  = (known after apply)
                              + os                            = {
                                  + name = (known after apply)
                                }
                              + overhead                      = (known after apply)
                              + preemptionPolicy              = (known after apply)
                              + priority                      = (known after apply)
                              + priorityClassName             = (known after apply)
                              + readinessGates                = (known after apply)
                              + resourceClaims                = (known after apply)
                              + resources                     = {
                                  + claims   = (known after apply)
                                  + limits   = (known after apply)
                                  + requests = (known after apply)
                                }
                              + restartPolicy                 = (known after apply)
                              + runtimeClassName              = (known after apply)
                              + schedulerName                 = (known after apply)
                              + schedulingGates               = (known after apply)
                              + securityContext               = {
                                  + appArmorProfile          = {
                                      + localhostProfile = (known after apply)
                                      + type             = (known after apply)
                                    }
                                  + fsGroup                  = 2000
                                  + fsGroupChangePolicy      = (known after apply)
                                  + runAsGroup               = 2000
                                  + runAsNonRoot             = true
                                  + runAsUser                = 2000
                                  + seLinuxChangePolicy      = (known after apply)
                                  + seLinuxOptions           = {
                                      + level = (known after apply)
                                      + role  = (known after apply)
                                      + type  = (known after apply)
                                      + user  = (known after apply)
                                    }
                                  + seccompProfile           = {
                                      + localhostProfile = (known after apply)
                                      + type             = "RuntimeDefault"
                                    }
                                  + supplementalGroups       = (known after apply)
                                  + supplementalGroupsPolicy = (known after apply)
                                  + sysctls                  = (known after apply)
                                  + windowsOptions           = {
                                      + gmsaCredentialSpec     = (known after apply)
                                      + gmsaCredentialSpecName = (known after apply)
                                      + hostProcess            = (known after apply)
                                      + runAsUserName          = (known after apply)
                                    }
                                }
                              + serviceAccount                = (known after apply)
                              + serviceAccountName            = (known after apply)
                              + setHostnameAsFQDN             = (known after apply)
                              + shareProcessNamespace         = (known after apply)
                              + subdomain                     = (known after apply)
                              + terminationGracePeriodSeconds = (known after apply)
                              + tolerations                   = (known after apply)
                              + topologySpreadConstraints     = (known after apply)
                              + volumes                       = (known after apply)
                            }
                        }
                    }
                }
              + serviceAccountTemplate = {
                  + metadata = {
                      + annotations = (known after apply)
                      + labels      = (known after apply)
                      + name        = (known after apply)
                    }
                }
              + serviceTemplate        = {
                  + metadata = {
                      + annotations = (known after apply)
                      + labels      = (known after apply)
                      + name        = (known after apply)
                    }
                }
            }
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.

[01KMEMTZZPBDCTX6M6QTZ80BCE] Changes are GO
[01KMEMTZZPBDCTX6M6QTZ80BCE] Generating JSON representation of the plan...
[01KMEMTZZPBDCTX6M6QTZ80BCE] JSON representation is GO
[01KMEMTZZPBDCTX6M6QTZ80BCE] Generating Infracost JSON report from plan

[01KMEMTZZPBDCTX6M6QTZ80BCE] Infracost report generated successfully
[01KMEMTZZPBDCTX6M6QTZ80BCE] Uploading the list of managed resources...
[01KMEMTZZPBDCTX6M6QTZ80BCE] Infracost report found from previous steps
[01KMEMTZZPBDCTX6M6QTZ80BCE] Mapping Infracost data to resources
[01KMEMTZZPBDCTX6M6QTZ80BCE] Costs mapped successfully
[01KMEMTZZPBDCTX6M6QTZ80BCE] Please be aware that the run changes calculation includes output changes.
[01KMEMTZZPBDCTX6M6QTZ80BCE] Resource list upload is GO
[01KMEMTZZPBDCTX6M6QTZ80BCE] Loading custom plan policy inputs...
[01KMEMTZZPBDCTX6M6QTZ80BCE] 4 custom plan policy inputs found: checkov, infracost, tflint, trivy
[01KMEMTZZPBDCTX6M6QTZ80BCE] Evaluated 6 plan policies
[01KMEMTZZPBDCTX6M6QTZ80BCE] Plan policy warning: 

🛠️ SECURITY & COST SUMMARY

💰 Cost Estimate: Total Monthly: $0 (Change: $0)

🛡️ Checkov: PASS (0 Failed Checks)

🛡️ Trivy: PASS (0 Findings)

🔍 TFLint: PASS (0 Issues)

🐽 TruffleHog: No data available.


[01KMEMTZZPBDCTX6M6QTZ80BCE] Plan checks are GO
```

</details>